; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite2 - satellite
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite5 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	image0 - mode
	infrared4 - mode
	spectrograph2 - mode
	infrared3 - mode
	thermograph1 - mode
	GroundStation41 - direction
	GroundStation45 - direction
	GroundStation42 - direction
	Star47 - direction
	GroundStation36 - direction
	Star22 - direction
	GroundStation54 - direction
	GroundStation28 - direction
	GroundStation2 - direction
	Star13 - direction
	Star15 - direction
	GroundStation18 - direction
	GroundStation58 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	Star21 - direction
	GroundStation53 - direction
	GroundStation48 - direction
	Star4 - direction
	Star38 - direction
	GroundStation26 - direction
	Star35 - direction
	Star19 - direction
	GroundStation46 - direction
	Star55 - direction
	GroundStation5 - direction
	Star56 - direction
	Star17 - direction
	Star44 - direction
	GroundStation40 - direction
	Star32 - direction
	GroundStation59 - direction
	Star25 - direction
	GroundStation9 - direction
	Star49 - direction
	GroundStation20 - direction
	GroundStation34 - direction
	GroundStation24 - direction
	Star7 - direction
	Star29 - direction
	GroundStation11 - direction
	Star16 - direction
	GroundStation37 - direction
	Star12 - direction
	GroundStation43 - direction
	GroundStation27 - direction
	Star51 - direction
	Star52 - direction
	Star14 - direction
	Star31 - direction
	Star33 - direction
	Star57 - direction
	GroundStation6 - direction
	Star3 - direction
	GroundStation50 - direction
	Star39 - direction
	GroundStation0 - direction
	Star23 - direction
	GroundStation10 - direction
	Star30 - direction
	Star60 - direction
	Phenomenon61 - direction
	Star62 - direction
	Star63 - direction
	Planet64 - direction
	Star65 - direction
	Phenomenon66 - direction
	Phenomenon67 - direction
	Planet68 - direction
	Planet69 - direction
	Star70 - direction
	Planet71 - direction
	Star72 - direction
	Phenomenon73 - direction
	Phenomenon74 - direction
	Planet75 - direction
	Planet76 - direction
	Star77 - direction
	Star78 - direction
	Planet79 - direction
	Phenomenon80 - direction
	Star81 - direction
	Planet82 - direction
	Planet83 - direction
	Star84 - direction
	Planet85 - direction
	Star86 - direction
	Phenomenon87 - direction
	Planet88 - direction
	Planet89 - direction
	Star90 - direction
	Planet91 - direction
	Star92 - direction
	Phenomenon93 - direction
	Star94 - direction
	Planet95 - direction
	Star96 - direction
	Star97 - direction
	Planet98 - direction
	Planet99 - direction
	Phenomenon100 - direction
	Star101 - direction
	Planet102 - direction
	Phenomenon103 - direction
	Planet104 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation59)
	(calibration_target instrument0 Star22)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star47)
	(calibration_target instrument0 Star32)
	(calibration_target instrument0 GroundStation48)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star49)
	(calibration_target instrument0 Star55)
	(calibration_target instrument0 Star57)
	(calibration_target instrument0 GroundStation41)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star38)
	(calibration_target instrument1 Star51)
	(calibration_target instrument1 Star23)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star35)
	(calibration_target instrument1 Star31)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 GroundStation54)
	(calibration_target instrument1 GroundStation46)
	(calibration_target instrument1 Star32)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared4)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star30)
	(calibration_target instrument2 Star16)
	(calibration_target instrument2 Star51)
	(calibration_target instrument2 GroundStation45)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 GroundStation40)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star33)
	(calibration_target instrument2 Star47)
	(calibration_target instrument2 GroundStation11)
	(supports instrument3 infrared3)
	(supports instrument3 image0)
	(supports instrument3 infrared4)
	(calibration_target instrument3 Star23)
	(calibration_target instrument3 GroundStation50)
	(calibration_target instrument3 Star32)
	(calibration_target instrument3 Star52)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star19)
	(calibration_target instrument3 Star38)
	(calibration_target instrument3 GroundStation40)
	(calibration_target instrument3 Star17)
	(calibration_target instrument3 GroundStation34)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 GroundStation37)
	(calibration_target instrument3 Star30)
	(calibration_target instrument3 GroundStation36)
	(calibration_target instrument3 Star56)
	(calibration_target instrument3 GroundStation11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet71)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star35)
	(supports instrument5 infrared4)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star15)
	(calibration_target instrument5 Star47)
	(calibration_target instrument5 Star30)
	(calibration_target instrument5 GroundStation37)
	(calibration_target instrument5 GroundStation40)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star23)
	(calibration_target instrument5 Star25)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation58)
	(calibration_target instrument5 GroundStation42)
	(calibration_target instrument5 GroundStation36)
	(calibration_target instrument5 GroundStation50)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation45)
	(calibration_target instrument5 GroundStation41)
	(calibration_target instrument5 Star52)
	(calibration_target instrument5 Star16)
	(calibration_target instrument5 GroundStation18)
	(supports instrument6 image0)
	(supports instrument6 infrared3)
	(supports instrument6 infrared4)
	(calibration_target instrument6 GroundStation36)
	(calibration_target instrument6 Star22)
	(calibration_target instrument6 GroundStation50)
	(calibration_target instrument6 Star52)
	(calibration_target instrument6 GroundStation20)
	(calibration_target instrument6 GroundStation40)
	(calibration_target instrument6 Star14)
	(calibration_target instrument6 Star33)
	(supports instrument7 spectrograph2)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star14)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 Star12)
	(calibration_target instrument7 Star52)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet76)
	(supports instrument8 thermograph1)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation36)
	(calibration_target instrument8 Star38)
	(calibration_target instrument8 GroundStation10)
	(calibration_target instrument8 Star19)
	(calibration_target instrument8 GroundStation54)
	(calibration_target instrument8 GroundStation18)
	(calibration_target instrument8 Star32)
	(calibration_target instrument8 Star39)
	(calibration_target instrument8 Star30)
	(calibration_target instrument8 Star16)
	(calibration_target instrument8 Star25)
	(calibration_target instrument8 Star12)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon93)
	(supports instrument9 infrared4)
	(supports instrument9 infrared3)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation28)
	(calibration_target instrument9 GroundStation1)
	(calibration_target instrument9 Star15)
	(calibration_target instrument9 GroundStation54)
	(calibration_target instrument9 GroundStation5)
	(calibration_target instrument9 GroundStation11)
	(calibration_target instrument9 Star39)
	(calibration_target instrument9 Star25)
	(calibration_target instrument9 Star22)
	(calibration_target instrument9 Star32)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star21)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation0)
	(calibration_target instrument10 Star30)
	(calibration_target instrument10 Star14)
	(calibration_target instrument10 Star44)
	(calibration_target instrument10 GroundStation20)
	(calibration_target instrument10 GroundStation9)
	(calibration_target instrument10 GroundStation8)
	(calibration_target instrument10 Star13)
	(calibration_target instrument10 GroundStation11)
	(calibration_target instrument10 Star31)
	(calibration_target instrument10 Star17)
	(calibration_target instrument10 GroundStation27)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 GroundStation43)
	(calibration_target instrument10 GroundStation48)
	(calibration_target instrument10 Star7)
	(calibration_target instrument10 Star12)
	(calibration_target instrument10 Star35)
	(supports instrument11 image0)
	(supports instrument11 thermograph1)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 GroundStation10)
	(calibration_target instrument11 Star32)
	(calibration_target instrument11 GroundStation26)
	(calibration_target instrument11 Star7)
	(calibration_target instrument11 Star25)
	(calibration_target instrument11 GroundStation48)
	(calibration_target instrument11 GroundStation53)
	(calibration_target instrument11 Star21)
	(calibration_target instrument11 GroundStation9)
	(calibration_target instrument11 GroundStation1)
	(calibration_target instrument11 GroundStation8)
	(calibration_target instrument11 Star55)
	(calibration_target instrument11 GroundStation34)
	(calibration_target instrument11 GroundStation43)
	(calibration_target instrument11 GroundStation58)
	(calibration_target instrument11 GroundStation18)
	(calibration_target instrument11 GroundStation5)
	(calibration_target instrument11 Star49)
	(calibration_target instrument11 Star15)
	(supports instrument12 image0)
	(supports instrument12 infrared3)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 Star16)
	(calibration_target instrument12 GroundStation27)
	(calibration_target instrument12 Star23)
	(calibration_target instrument12 Star55)
	(calibration_target instrument12 GroundStation46)
	(calibration_target instrument12 Star19)
	(calibration_target instrument12 Star35)
	(calibration_target instrument12 GroundStation59)
	(calibration_target instrument12 GroundStation26)
	(calibration_target instrument12 Star25)
	(calibration_target instrument12 Star30)
	(calibration_target instrument12 GroundStation34)
	(calibration_target instrument12 Star38)
	(calibration_target instrument12 Star52)
	(calibration_target instrument12 Star39)
	(calibration_target instrument12 GroundStation11)
	(calibration_target instrument12 Star4)
	(calibration_target instrument12 Star51)
	(calibration_target instrument12 Star49)
	(supports instrument13 infrared4)
	(supports instrument13 infrared3)
	(supports instrument13 thermograph1)
	(calibration_target instrument13 GroundStation59)
	(calibration_target instrument13 Star32)
	(calibration_target instrument13 GroundStation40)
	(calibration_target instrument13 Star44)
	(calibration_target instrument13 GroundStation37)
	(calibration_target instrument13 Star17)
	(calibration_target instrument13 Star56)
	(calibration_target instrument13 Star12)
	(calibration_target instrument13 Star52)
	(calibration_target instrument13 Star16)
	(calibration_target instrument13 Star39)
	(calibration_target instrument13 GroundStation24)
	(calibration_target instrument13 GroundStation34)
	(calibration_target instrument13 GroundStation10)
	(calibration_target instrument13 Star33)
	(calibration_target instrument13 GroundStation5)
	(calibration_target instrument13 Star51)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation34)
	(supports instrument14 spectrograph2)
	(calibration_target instrument14 GroundStation34)
	(calibration_target instrument14 GroundStation20)
	(calibration_target instrument14 Star3)
	(calibration_target instrument14 Star49)
	(calibration_target instrument14 GroundStation9)
	(calibration_target instrument14 Star57)
	(calibration_target instrument14 Star25)
	(calibration_target instrument14 GroundStation6)
	(calibration_target instrument14 Star16)
	(calibration_target instrument14 GroundStation24)
	(calibration_target instrument14 Star31)
	(supports instrument15 infrared3)
	(calibration_target instrument15 GroundStation27)
	(calibration_target instrument15 GroundStation10)
	(calibration_target instrument15 GroundStation43)
	(calibration_target instrument15 Star12)
	(calibration_target instrument15 GroundStation37)
	(calibration_target instrument15 Star16)
	(calibration_target instrument15 GroundStation11)
	(calibration_target instrument15 Star29)
	(calibration_target instrument15 GroundStation6)
	(calibration_target instrument15 Star3)
	(calibration_target instrument15 Star7)
	(calibration_target instrument15 GroundStation24)
	(supports instrument16 thermograph1)
	(calibration_target instrument16 GroundStation10)
	(calibration_target instrument16 Star23)
	(calibration_target instrument16 GroundStation0)
	(calibration_target instrument16 Star39)
	(calibration_target instrument16 GroundStation50)
	(calibration_target instrument16 Star3)
	(calibration_target instrument16 GroundStation6)
	(calibration_target instrument16 Star57)
	(calibration_target instrument16 Star33)
	(calibration_target instrument16 Star31)
	(calibration_target instrument16 Star14)
	(calibration_target instrument16 Star52)
	(calibration_target instrument16 Star51)
	(supports instrument17 thermograph1)
	(calibration_target instrument17 Star30)
	(on_board instrument14 satellite5)
	(on_board instrument15 satellite5)
	(on_board instrument16 satellite5)
	(on_board instrument17 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star62)
)
(:goal (and
	(pointing satellite1 Star78)
	(pointing satellite5 GroundStation5)
	(have_image Star60 spectrograph2)
	(have_image Phenomenon61 image0)
	(have_image Star62 infrared4)
	(have_image Star63 infrared3)
	(have_image Planet64 infrared4)
	(have_image Star65 spectrograph2)
	(have_image Phenomenon66 infrared3)
	(have_image Phenomenon67 spectrograph2)
	(have_image Planet68 spectrograph2)
	(have_image Planet69 infrared4)
	(have_image Star70 image0)
	(have_image Planet71 infrared4)
	(have_image Star72 spectrograph2)
	(have_image Phenomenon73 spectrograph2)
	(have_image Phenomenon74 spectrograph2)
	(have_image Planet75 infrared3)
	(have_image Planet76 infrared4)
	(have_image Star77 image0)
	(have_image Star78 infrared3)
	(have_image Planet79 infrared4)
	(have_image Phenomenon80 image0)
	(have_image Star81 infrared4)
	(have_image Planet82 infrared3)
	(have_image Planet83 infrared3)
	(have_image Star84 thermograph1)
	(have_image Planet85 image0)
	(have_image Star86 thermograph1)
	(have_image Phenomenon87 spectrograph2)
	(have_image Planet88 infrared3)
	(have_image Planet89 image0)
	(have_image Star90 infrared3)
	(have_image Planet91 infrared4)
	(have_image Star92 thermograph1)
	(have_image Phenomenon93 image0)
	(have_image Star94 image0)
	(have_image Planet95 spectrograph2)
	(have_image Star96 spectrograph2)
	(have_image Star97 image0)
	(have_image Planet98 thermograph1)
	(have_image Planet99 thermograph1)
	(have_image Phenomenon100 infrared3)
	(have_image Star101 infrared3)
	(have_image Planet102 image0)
	(have_image Phenomenon103 image0)
	(have_image Planet104 infrared4)
))

)

; plan
1. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 0 of 47
2. (calibrate satellite4 instrument11 groundstation34)
   added: (calibrated instrument11)
   goals met: 0 of 47
3. (switch_on instrument6 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument6)
   goals met: 0 of 47
4. (turn_to satellite5 groundstation5 star62)
   deleted: (pointing satellite5 star62)
   added: (pointing satellite5 groundstation5)
   goals met: 1 of 47
5. (turn_to satellite4 phenomenon103 groundstation34)
   deleted: (pointing satellite4 groundstation34)
   added: (pointing satellite4 phenomenon103)
   goals met: 1 of 47
6. (take_image satellite4 phenomenon103 instrument11 image0)
   added: (have_image phenomenon103 image0)
   goals met: 2 of 47
7. (turn_to satellite4 phenomenon61 phenomenon103)
   deleted: (pointing satellite4 phenomenon103)
   added: (pointing satellite4 phenomenon61)
   goals met: 2 of 47
8. (take_image satellite4 phenomenon61 instrument11 image0)
   added: (have_image phenomenon61 image0)
   goals met: 3 of 47
9. (turn_to satellite4 phenomenon67 phenomenon61)
   deleted: (pointing satellite4 phenomenon61)
   added: (pointing satellite4 phenomenon67)
   goals met: 3 of 47
10. (take_image satellite4 phenomenon67 instrument11 spectrograph2)
   added: (have_image phenomenon67 spectrograph2)
   goals met: 4 of 47
11. (turn_to satellite4 phenomenon73 phenomenon67)
   deleted: (pointing satellite4 phenomenon67)
   added: (pointing satellite4 phenomenon73)
   goals met: 4 of 47
12. (take_image satellite4 phenomenon73 instrument11 spectrograph2)
   added: (have_image phenomenon73 spectrograph2)
   goals met: 5 of 47
13. (turn_to satellite4 phenomenon74 phenomenon73)
   deleted: (pointing satellite4 phenomenon73)
   added: (pointing satellite4 phenomenon74)
   goals met: 5 of 47
14. (take_image satellite4 phenomenon74 instrument11 spectrograph2)
   added: (have_image phenomenon74 spectrograph2)
   goals met: 6 of 47
15. (turn_to satellite4 phenomenon80 phenomenon74)
   deleted: (pointing satellite4 phenomenon74)
   added: (pointing satellite4 phenomenon80)
   goals met: 6 of 47
16. (take_image satellite4 phenomenon80 instrument11 image0)
   added: (have_image phenomenon80 image0)
   goals met: 7 of 47
17. (turn_to satellite4 phenomenon87 phenomenon80)
   deleted: (pointing satellite4 phenomenon80)
   added: (pointing satellite4 phenomenon87)
   goals met: 7 of 47
18. (take_image satellite4 phenomenon87 instrument11 spectrograph2)
   added: (have_image phenomenon87 spectrograph2)
   goals met: 8 of 47
19. (turn_to satellite4 phenomenon93 phenomenon87)
   deleted: (pointing satellite4 phenomenon87)
   added: (pointing satellite4 phenomenon93)
   goals met: 8 of 47
20. (take_image satellite4 phenomenon93 instrument11 image0)
   added: (have_image phenomenon93 image0)
   goals met: 9 of 47
21. (turn_to satellite4 planet102 phenomenon93)
   deleted: (pointing satellite4 phenomenon93)
   added: (pointing satellite4 planet102)
   goals met: 9 of 47
22. (take_image satellite4 planet102 instrument11 image0)
   added: (have_image planet102 image0)
   goals met: 10 of 47
23. (turn_to satellite4 planet68 planet102)
   deleted: (pointing satellite4 planet102)
   added: (pointing satellite4 planet68)
   goals met: 10 of 47
24. (take_image satellite4 planet68 instrument11 spectrograph2)
   added: (have_image planet68 spectrograph2)
   goals met: 11 of 47
25. (turn_to satellite4 planet85 planet68)
   deleted: (pointing satellite4 planet68)
   added: (pointing satellite4 planet85)
   goals met: 11 of 47
26. (take_image satellite4 planet85 instrument11 image0)
   added: (have_image planet85 image0)
   goals met: 12 of 47
27. (turn_to satellite4 planet89 planet85)
   deleted: (pointing satellite4 planet85)
   added: (pointing satellite4 planet89)
   goals met: 12 of 47
28. (take_image satellite4 planet89 instrument11 image0)
   added: (have_image planet89 image0)
   goals met: 13 of 47
29. (turn_to satellite4 planet95 planet89)
   deleted: (pointing satellite4 planet89)
   added: (pointing satellite4 planet95)
   goals met: 13 of 47
30. (take_image satellite4 planet95 instrument11 spectrograph2)
   added: (have_image planet95 spectrograph2)
   goals met: 14 of 47
31. (turn_to satellite4 planet98 planet95)
   deleted: (pointing satellite4 planet95)
   added: (pointing satellite4 planet98)
   goals met: 14 of 47
32. (take_image satellite4 planet98 instrument11 thermograph1)
   added: (have_image planet98 thermograph1)
   goals met: 15 of 47
33. (turn_to satellite4 planet99 planet98)
   deleted: (pointing satellite4 planet98)
   added: (pointing satellite4 planet99)
   goals met: 15 of 47
34. (take_image satellite4 planet99 instrument11 thermograph1)
   added: (have_image planet99 thermograph1)
   goals met: 16 of 47
35. (turn_to satellite4 star60 planet99)
   deleted: (pointing satellite4 planet99)
   added: (pointing satellite4 star60)
   goals met: 16 of 47
36. (take_image satellite4 star60 instrument11 spectrograph2)
   added: (have_image star60 spectrograph2)
   goals met: 17 of 47
37. (turn_to satellite4 star65 star60)
   deleted: (pointing satellite4 star60)
   added: (pointing satellite4 star65)
   goals met: 17 of 47
38. (take_image satellite4 star65 instrument11 spectrograph2)
   added: (have_image star65 spectrograph2)
   goals met: 18 of 47
39. (turn_to satellite4 star70 star65)
   deleted: (pointing satellite4 star65)
   added: (pointing satellite4 star70)
   goals met: 18 of 47
40. (take_image satellite4 star70 instrument11 image0)
   added: (have_image star70 image0)
   goals met: 19 of 47
41. (turn_to satellite4 star72 star70)
   deleted: (pointing satellite4 star70)
   added: (pointing satellite4 star72)
   goals met: 19 of 47
42. (take_image satellite4 star72 instrument11 spectrograph2)
   added: (have_image star72 spectrograph2)
   goals met: 20 of 47
43. (turn_to satellite4 star77 star72)
   deleted: (pointing satellite4 star72)
   added: (pointing satellite4 star77)
   goals met: 20 of 47
44. (take_image satellite4 star77 instrument11 image0)
   added: (have_image star77 image0)
   goals met: 21 of 47
45. (turn_to satellite4 star84 star77)
   deleted: (pointing satellite4 star77)
   added: (pointing satellite4 star84)
   goals met: 21 of 47
46. (take_image satellite4 star84 instrument11 thermograph1)
   added: (have_image star84 thermograph1)
   goals met: 22 of 47
47. (turn_to satellite4 star86 star84)
   deleted: (pointing satellite4 star84)
   added: (pointing satellite4 star86)
   goals met: 22 of 47
48. (take_image satellite4 star86 instrument11 thermograph1)
   added: (have_image star86 thermograph1)
   goals met: 23 of 47
49. (turn_to satellite4 star92 star86)
   deleted: (pointing satellite4 star86)
   added: (pointing satellite4 star92)
   goals met: 23 of 47
50. (take_image satellite4 star92 instrument11 thermograph1)
   added: (have_image star92 thermograph1)
   goals met: 24 of 47
51. (turn_to satellite4 star94 star92)
   deleted: (pointing satellite4 star92)
   added: (pointing satellite4 star94)
   goals met: 24 of 47
52. (take_image satellite4 star94 instrument11 image0)
   added: (have_image star94 image0)
   goals met: 25 of 47
53. (turn_to satellite4 star96 star94)
   deleted: (pointing satellite4 star94)
   added: (pointing satellite4 star96)
   goals met: 25 of 47
54. (take_image satellite4 star96 instrument11 spectrograph2)
   added: (have_image star96 spectrograph2)
   goals met: 26 of 47
55. (turn_to satellite4 star97 star96)
   deleted: (pointing satellite4 star96)
   added: (pointing satellite4 star97)
   goals met: 26 of 47
56. (take_image satellite4 star97 instrument11 image0)
   added: (have_image star97 image0)
   goals met: 27 of 47
57. (turn_to satellite1 star52 planet76)
   deleted: (pointing satellite1 planet76)
   added: (pointing satellite1 star52)
   goals met: 27 of 47
58. (calibrate satellite1 instrument6 star52)
   added: (calibrated instrument6)
   goals met: 27 of 47
59. (turn_to satellite1 phenomenon100 star52)
   deleted: (pointing satellite1 star52)
   added: (pointing satellite1 phenomenon100)
   goals met: 27 of 47
60. (take_image satellite1 phenomenon100 instrument6 infrared3)
   added: (have_image phenomenon100 infrared3)
   goals met: 28 of 47
61. (turn_to satellite1 phenomenon66 phenomenon100)
   deleted: (pointing satellite1 phenomenon100)
   added: (pointing satellite1 phenomenon66)
   goals met: 28 of 47
62. (take_image satellite1 phenomenon66 instrument6 infrared3)
   added: (have_image phenomenon66 infrared3)
   goals met: 29 of 47
63. (turn_to satellite1 planet104 phenomenon66)
   deleted: (pointing satellite1 phenomenon66)
   added: (pointing satellite1 planet104)
   goals met: 29 of 47
64. (take_image satellite1 planet104 instrument6 infrared4)
   added: (have_image planet104 infrared4)
   goals met: 30 of 47
65. (turn_to satellite1 planet64 planet104)
   deleted: (pointing satellite1 planet104)
   added: (pointing satellite1 planet64)
   goals met: 30 of 47
66. (take_image satellite1 planet64 instrument6 infrared4)
   added: (have_image planet64 infrared4)
   goals met: 31 of 47
67. (turn_to satellite1 planet69 planet64)
   deleted: (pointing satellite1 planet64)
   added: (pointing satellite1 planet69)
   goals met: 31 of 47
68. (take_image satellite1 planet69 instrument6 infrared4)
   added: (have_image planet69 infrared4)
   goals met: 32 of 47
69. (turn_to satellite1 planet71 planet69)
   deleted: (pointing satellite1 planet69)
   added: (pointing satellite1 planet71)
   goals met: 32 of 47
70. (take_image satellite1 planet71 instrument6 infrared4)
   added: (have_image planet71 infrared4)
   goals met: 33 of 47
71. (turn_to satellite1 planet75 planet71)
   deleted: (pointing satellite1 planet71)
   added: (pointing satellite1 planet75)
   goals met: 33 of 47
72. (take_image satellite1 planet75 instrument6 infrared3)
   added: (have_image planet75 infrared3)
   goals met: 34 of 47
73. (turn_to satellite1 planet76 planet75)
   deleted: (pointing satellite1 planet75)
   added: (pointing satellite1 planet76)
   goals met: 34 of 47
74. (take_image satellite1 planet76 instrument6 infrared4)
   added: (have_image planet76 infrared4)
   goals met: 35 of 47
75. (turn_to satellite1 planet79 planet76)
   deleted: (pointing satellite1 planet76)
   added: (pointing satellite1 planet79)
   goals met: 35 of 47
76. (take_image satellite1 planet79 instrument6 infrared4)
   added: (have_image planet79 infrared4)
   goals met: 36 of 47
77. (turn_to satellite1 planet82 planet79)
   deleted: (pointing satellite1 planet79)
   added: (pointing satellite1 planet82)
   goals met: 36 of 47
78. (take_image satellite1 planet82 instrument6 infrared3)
   added: (have_image planet82 infrared3)
   goals met: 37 of 47
79. (turn_to satellite1 planet83 planet82)
   deleted: (pointing satellite1 planet82)
   added: (pointing satellite1 planet83)
   goals met: 37 of 47
80. (take_image satellite1 planet83 instrument6 infrared3)
   added: (have_image planet83 infrared3)
   goals met: 38 of 47
81. (turn_to satellite1 planet88 planet83)
   deleted: (pointing satellite1 planet83)
   added: (pointing satellite1 planet88)
   goals met: 38 of 47
82. (take_image satellite1 planet88 instrument6 infrared3)
   added: (have_image planet88 infrared3)
   goals met: 39 of 47
83. (turn_to satellite1 planet91 planet88)
   deleted: (pointing satellite1 planet88)
   added: (pointing satellite1 planet91)
   goals met: 39 of 47
84. (take_image satellite1 planet91 instrument6 infrared4)
   added: (have_image planet91 infrared4)
   goals met: 40 of 47
85. (turn_to satellite1 star101 planet91)
   deleted: (pointing satellite1 planet91)
   added: (pointing satellite1 star101)
   goals met: 40 of 47
86. (take_image satellite1 star101 instrument6 infrared3)
   added: (have_image star101 infrared3)
   goals met: 41 of 47
87. (turn_to satellite1 star62 star101)
   deleted: (pointing satellite1 star101)
   added: (pointing satellite1 star62)
   goals met: 41 of 47
88. (take_image satellite1 star62 instrument6 infrared4)
   added: (have_image star62 infrared4)
   goals met: 42 of 47
89. (turn_to satellite1 star63 star62)
   deleted: (pointing satellite1 star62)
   added: (pointing satellite1 star63)
   goals met: 42 of 47
90. (take_image satellite1 star63 instrument6 infrared3)
   added: (have_image star63 infrared3)
   goals met: 43 of 47
91. (turn_to satellite1 star78 star63)
   deleted: (pointing satellite1 star63)
   added: (pointing satellite1 star78)
   goals met: 44 of 47
92. (take_image satellite1 star78 instrument6 infrared3)
   added: (have_image star78 infrared3)
   goals met: 45 of 47
93. (turn_to satellite1 star81 star78)
   deleted: (pointing satellite1 star78)
   added: (pointing satellite1 star81)
   goals met: 44 of 47
94. (take_image satellite1 star81 instrument6 infrared4)
   added: (have_image star81 infrared4)
   goals met: 45 of 47
95. (turn_to satellite1 star78 star81)
   deleted: (pointing satellite1 star81)
   added: (pointing satellite1 star78)
   goals met: 46 of 47
96. (turn_to satellite1 star90 star78)
   deleted: (pointing satellite1 star78)
   added: (pointing satellite1 star90)
   goals met: 45 of 47
97. (take_image satellite1 star90 instrument6 infrared3)
   added: (have_image star90 infrared3)
   goals met: 46 of 47
98. (turn_to satellite1 star78 star90)
   deleted: (pointing satellite1 star90)
   added: (pointing satellite1 star78)
   goals met: 47 of 47
